In [1]:
import numpy as np
import pandas as pd
data=pd.read_csv('D:\pandasdataset\project\Bengaluru_House_Data.csv')

In [2]:
data.head()

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00

In [44]:
#import pandas_profiling

In [4]:
#from pandas_profiling import ProfileReport

In [5]:
#profile=ProfileReport(data,title='House_Price_Value_Data_Profile',html={'style':{'full_width':True}})

In [6]:
#profile.to_file("sample_file_name.html")

In [7]:
data.describe()

               bath       balcony         price
count  13247.000000  12711.000000  13320.000000
mean       2.692610      1.584376    112.565627
std        1.341458      0.817263    148.971674
min        1.000000      0.000000      8.000000
25%        2.000000      1.000000     50.000000
50%        2.000000      2.000000     72.000000
75%        3.000000      2.000000    120.000000
max       40.000000      3.000000   3600.000000

In [8]:
data.columns

Index(['area_type', 'availability', 'location', 'size', 'society',
       'total_sqft', 'bath', 'balcony', 'price'],
      dtype='object')

In [9]:
data=data.drop(['area_type', 'availability','society','balcony'],axis=1)

In [10]:
data.head()

                   location       size total_sqft  bath   price
0  Electronic City Phase II      2 BHK       1056   2.0   39.07
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00
2               Uttarahalli      3 BHK       1440   2.0   62.00
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00
4                  Kothanur      2 BHK       1200   2.0   51.00

In [11]:
data.isnull().sum()

location       1
size          16
total_sqft     0
bath          73
price          0
dtype: int64

In [12]:
data=data.dropna()

In [13]:
data['bhk']=data['size'].apply(lambda x:int(x.split(' ')[0]))

In [15]:
data.head(10)

                   location       size total_sqft  bath   price  bhk
0  Electronic City Phase II      2 BHK       1056   2.0   39.07    2
1          Chikka Tirupathi  4 Bedroom       2600   5.0  120.00    4
2               Uttarahalli      3 BHK       1440   2.0   62.00    3
3        Lingadheeranahalli      3 BHK       1521   3.0   95.00    3
4                  Kothanur      2 BHK       1200   2.0   51.00    2
5                Whitefield      2 BHK       1170   2.0   38.00    2
6          Old Airport Road      4 BHK       2732   4.0  204.00    4
7              Rajaji Nagar      4 BHK       3300   4.0  600.00    4
8              Marathahalli      3 BHK       1310   3.0   63.25    3
9              Gandhi Bazar  6 Bedroom       1020   6.0  370.00    6

In [16]:
data['total_sqft'].unique()

array(['1056', '2600', '1440', ..., '1133 - 1384', '774', '4689'],
      dtype=object)

In [17]:
def is_float(x):
    try:
        float(x)
    except:
        return False
    return True

In [18]:
data[~data['total_sqft'].apply(is_float)]

                 location   size   total_sqft  bath    price  bhk
30              Yelahanka  4 BHK  2100 - 2850   4.0  186.000    4
122                Hebbal  4 BHK  3067 - 8156   4.0  477.000    4
137    8th Phase JP Nagar  2 BHK  1042 - 1105   2.0   54.005    2
165              Sarjapur  2 BHK  1145 - 1340   2.0   43.490    2
188              KR Puram  2 BHK  1015 - 1540   2.0   56.800    2
...                   ...    ...          ...   ...      ...  ...
12975          Whitefield  2 BHK   850 - 1060   2.0   38.190    2
12990      Talaghattapura  3 BHK  1804 - 2273   3.0  122.000    3
13059              Harlur  2 BHK  1200 - 1470   2.0   72.760    2
13265               Hoodi  2 BHK  1133 - 1384   2.0   59.135    2
13299          Whitefield  4 BHK  2830 - 2882   5.0  154.500    4

[190 rows x 6 columns]

In [19]:
def convert_sqft_to_num(x):
    tokens=x.split('-')
    if len(tokens)==2:
        return (float(tokens[0])+float(tokens[1]))/2
    try:
        return float(x)
    except:
        return None

In [20]:
data['total_sqft']=data['total_sqft'].apply(convert_sqft_to_num)

In [21]:
data.columns

Index(['location', 'size', 'total_sqft', 'bath', 'price', 'bhk'], dtype='object')

In [22]:
data=data.drop(['size'],axis=1)

In [23]:
data.head()

                   location  total_sqft  bath   price  bhk
0  Electronic City Phase II      1056.0   2.0   39.07    2
1          Chikka Tirupathi      2600.0   5.0  120.00    4
2               Uttarahalli      1440.0   2.0   62.00    3
3        Lingadheeranahalli      1521.0   3.0   95.00    3
4                  Kothanur      1200.0   2.0   51.00    2

In [24]:
#creating new feature price/sqft
data['price/sqft']=data['price']*100000/data['total_sqft']
data.head()

                   location  total_sqft  bath   price  bhk   price/sqft
0  Electronic City Phase II      1056.0   2.0   39.07    2  3699.810606
1          Chikka Tirupathi      2600.0   5.0  120.00    4  4615.384615
2               Uttarahalli      1440.0   2.0   62.00    3  4305.555556
3        Lingadheeranahalli      1521.0   3.0   95.00    3  6245.890861
4                  Kothanur      1200.0   2.0   51.00    2  4250.000000

In [25]:
data.location=data.location.apply(lambda x:x.strip())
location_count=data.groupby('location')['location'].agg('count').sort_values(ascending=False)

In [26]:
location_less_than_10=location_count[location_count<=10]

In [27]:
data.location=data.location.apply(lambda x:'others' if x in location_less_than_10 else x)

In [28]:
len(data.location.unique())

242

In [31]:
data['price/sqft'].describe()

count    1.320000e+04
mean     7.920759e+03
std      1.067272e+05
min      2.678298e+02
25%      4.267701e+03
50%      5.438331e+03
75%      7.317073e+03
max      1.200000e+07
Name: price/sqft, dtype: float64

In [32]:
def remove_outliers(data):
    data_out=pd.DataFrame()
    for key, subdf in data.groupby('location'):
        m=np.mean(subdf['price/sqft'])
        st=np.std(subdf['price/sqft'])
        reduced_df=subdf[(subdf['price/sqft']>(m-st)) & (subdf['price/sqft']<=(m+st))]
        data_out=pd.concat([data_out,reduced_df],ignore_index=True)
    return data_out

In [33]:
data=remove_outliers(data)

In [34]:
data.shape

(11428, 6)

In [35]:
data[data.bath>data.bhk+2]

            location  total_sqft  bath   price  bhk    price/sqft
1635      Chamrajpet      1500.0   9.0   230.0    6  15333.333333
1771   Chikkabanavar      2460.0   7.0    80.0    4   3252.032520
5604      Nagasandra      7000.0   8.0   450.0    4   6428.571429
7229     Thanisandra      1806.0   6.0   116.0    3   6423.034330
8812          others      3300.0  14.0   500.0    9  15151.515152
9007          others       990.0  12.0   120.0    8  12121.212121
9149          others     11338.0   9.0  1000.0    6   8819.897689
10308         others      1850.0  12.0   300.0    8  16216.216216
10693         others      2400.0   6.0   775.0    3  32291.666667
10700         others      1200.0   9.0   122.0    6  10166.666667
11365         others      7150.0  13.0  3600.0   10  50349.650350

In [36]:
data=data[data.bath<data.bhk+2]

In [37]:
data.shape

(11301, 6)

In [38]:
data.head()

              location  total_sqft  bath  price  bhk    price/sqft
0  1st Block Jayanagar      2850.0   4.0  428.0    4  15017.543860
1  1st Block Jayanagar      1630.0   3.0  194.0    3  11901.840491
2  1st Block Jayanagar      1200.0   6.0  125.0    6  10416.666667
3  1st Block Jayanagar      1875.0   2.0  235.0    3  12533.333333
4  1st Block Jayanagar       930.0   4.0   85.0    7   9139.784946

In [39]:
data=data.drop(['price/sqft'],axis=1)

In [40]:
data.head()

              location  total_sqft  bath  price  bhk
0  1st Block Jayanagar      2850.0   4.0  428.0    4
1  1st Block Jayanagar      1630.0   3.0  194.0    3
2  1st Block Jayanagar      1200.0   6.0  125.0    6
3  1st Block Jayanagar      1875.0   2.0  235.0    3
4  1st Block Jayanagar       930.0   4.0   85.0    7

In [46]:
dummies=pd.get_dummies(data['location'])

In [47]:
data=pd.concat([data,dummies.drop('others',axis=1)],axis=1)

In [50]:
data=data.drop('location',axis=1)

In [51]:
data.shape

(11301, 245)

In [52]:
x=data.drop('price',axis=1)

In [53]:
y=data.price

In [54]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.2,random_state=10)

In [55]:
from sklearn.linear_model import LinearRegression
model=LinearRegression()
model.fit(x_train,y_train)
model.score(x_test,y_test)

0.5488512091319622

In [57]:
data.columns

Index(['total_sqft', 'bath', 'price', 'bhk', '1st Block Jayanagar',
       '1st Phase JP Nagar', '2nd Phase Judicial Layout',
       '2nd Stage Nagarbhavi', '5th Block Hbr Layout', '5th Phase JP Nagar',
       ...
       'Vijayanagar', 'Vishveshwarya Layout', 'Vishwapriya Layout',
       'Vittasandra', 'Whitefield', 'Yelachenahalli', 'Yelahanka',
       'Yelahanka New Town', 'Yelenahalli', 'Yeshwanthpur'],
      dtype='object', length=245)

In [60]:
def predict_price(location,sqft,bath,bhk):
    loc_index=np.where(x.columns==location)[0][0]
    X=np.zeros(len(x.columns))
    X[0]=sqft
    X[1]=bath
    X[2]=bhk
    if loc_index >= 0:
        X[loc_index]=1
    return model.predict([X])[0]

In [61]:
predict_price('Vijayanagar',1000,2,2)

61.40024812339638

In [62]:
import pickle
with open('banglore_house_price_model_pickle','wb') as f:
    pickle.dump(model,f)

In [63]:
import json
columns ={
    'data_columns' : [col.lower() for col in x.columns]
}
with open('columns.json','w') as f:
    f.write(json.dumps(columns))